test/logs/k6_logs.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: /Users/ramantehlan/Workspace/go/src/github.com/truefoundry/elasti/test/load.js
 web dashboard: http://127.0.0.1:5665
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 100 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 100 VUs  01.0s/30s

running (0m02.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  02.0s/30s

running (0m03.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 100 VUs  03.0s/30s

running (0m04.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 100 VUs  04.0s/30s

running (0m05.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  17% ] 100 VUs  05.0s/30s

running (0m06.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 100 VUs  06.0s/30s

running (0m07.0s), 100/100 VUs, 3 complete and 0 interrupted iterations
default   [  23% ] 100 VUs  07.0s/30s

running (0m08.0s), 100/100 VUs, 10 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  08.0s/30s

running (0m09.0s), 100/100 VUs, 25 complete and 0 interrupted iterations
default   [  30% ] 100 VUs  09.0s/30s

running (0m10.0s), 100/100 VUs, 45 complete and 0 interrupted iterations
default   [  33% ] 100 VUs  10.0s/30s

running (0m11.0s), 100/100 VUs, 70 complete and 0 interrupted iterations
default   [  37% ] 100 VUs  11.0s/30s

running (0m12.0s), 100/100 VUs, 97 complete and 0 interrupted iterations
default   [  40% ] 100 VUs  12.0s/30s

running (0m13.0s), 100/100 VUs, 131 complete and 0 interrupted iterations
default   [  43% ] 100 VUs  13.0s/30s

running (0m14.0s), 100/100 VUs, 165 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  14.0s/30s

running (0m15.0s), 100/100 VUs, 208 complete and 0 interrupted iterations
default   [  50% ] 100 VUs  15.0s/30s

running (0m16.0s), 100/100 VUs, 256 complete and 0 interrupted iterations
default   [  53% ] 100 VUs  16.0s/30s

running (0m17.0s), 100/100 VUs, 306 complete and 0 interrupted iterations
default   [  57% ] 100 VUs  17.0s/30s

running (0m18.0s), 100/100 VUs, 364 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  18.0s/30s

running (0m19.0s), 100/100 VUs, 426 complete and 0 interrupted iterations
default   [  63% ] 100 VUs  19.0s/30s

running (0m20.0s), 100/100 VUs, 494 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  20.0s/30s

running (0m21.0s), 100/100 VUs, 568 complete and 0 interrupted iterations
default   [  70% ] 100 VUs  21.0s/30s

running (0m22.0s), 100/100 VUs, 645 complete and 0 interrupted iterations
default   [  73% ] 100 VUs  22.0s/30s

running (0m23.0s), 100/100 VUs, 731 complete and 0 interrupted iterations
default   [  77% ] 100 VUs  23.0s/30s

running (0m24.0s), 100/100 VUs, 816 complete and 0 interrupted iterations
default   [  80% ] 100 VUs  24.0s/30s

running (0m25.0s), 100/100 VUs, 913 complete and 0 interrupted iterations
default   [  83% ] 100 VUs  25.0s/30s

running (0m26.0s), 100/100 VUs, 1001 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  26.0s/30s

running (0m27.0s), 100/100 VUs, 1096 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  27.0s/30s

running (0m28.0s), 100/100 VUs, 1191 complete and 0 interrupted iterations
default   [  93% ] 100 VUs  28.0s/30s

running (0m29.0s), 100/100 VUs, 1283 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  29.0s/30s

running (0m30.0s), 100/100 VUs, 1377 complete and 0 interrupted iterations
default   [ 100% ] 100 VUs  30.0s/30s

running (0m31.0s), 007/100 VUs, 1470 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  30s

     ✓ status was 200

     checks.........................: 100.00% ✓ 4431       ✗ 0    
     data_received..................: 10 MB   336 kB/s
     data_sent......................: 393 kB  13 kB/s
     failed_requests_1..............: 0.00%   ✓ 0          ✗ 1477 
     failed_requests_2..............: 0.00%   ✓ 0          ✗ 1477 
     failed_requests_3..............: 0.00%   ✓ 0          ✗ 1477 
     http_req_blocked...............: avg=29.05ms  min=0s       med=1µs      max=888.7ms  p(90)=2µs      p(95)=210.32ms
     http_req_connecting............: avg=7.9ms    min=0s       med=0s       max=258.86ms p(90)=0s       p(95)=88.78ms 
     http_req_duration..............: avg=658.57ms min=317.49ms med=352.04ms max=19.16s   p(90)=385.81ms p(95)=628.76ms
       { expected_response:true }...: avg=658.57ms min=317.49ms med=352.04ms max=19.16s   p(90)=385.81ms p(95)=628.76ms
     http_req_failed................: 0.00%   ✓ 0          ✗ 4431 
     http_req_receiving.............: avg=1.61ms   min=10µs     med=110µs    max=74.64ms  p(90)=4.3ms    p(95)=11.04ms 
     http_req_sending...............: avg=91.44µs  min=10µs     med=82µs     max=1.62ms   p(90)=157µs    p(95)=188µs   
     http_req_tls_handshaking.......: avg=19.71ms  min=0s       med=0s       max=688.33ms p(90)=0s       p(95)=113.84ms
     http_req_waiting...............: avg=656.87ms min=315.83ms med=350.26ms max=19.16s   p(90)=382.93ms p(95)=627.43ms
     http_reqs......................: 4431    142.326318/s
     iteration_duration.............: avg=2.06s    min=989.98ms med=1.05s    max=25.11s   p(90)=1.24s    p(95)=11.16s  
     iterations.....................: 1477    47.442106/s
     vus............................: 7       min=7        max=100
     vus_max........................: 100     min=100      max=100


running (0m31.1s), 000/100 VUs, 1477 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  30s